# What is a DataFrame?
### A DataFrame is a 2D labeled data structure with columns that can be of different types. Think of it as:

* A spreadsheet or SQL table
* A dictionary of Series objects
* The most important data structure in Pandas!

## üèóÔ∏è Creating DataFrames

### 1- From Dictionary

In [6]:
import pandas as pd
import numpy as np

# Method 1: Dictionary of lists
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'Age': [25, 30, 35, 28],
    'City': ['New York', 'Paris', 'London', 'Tokyo'],
    'Salary': [70000, 80000, 75000, 85000]
}
df = pd.DataFrame(data)
df

      Name  Age      City  Salary
0    Alice   25  New York   70000
1      Bob   30     Paris   80000
2  Charlie   35    London   75000
3    David   28     Tokyo   85000

### 2- Dictionary of Series

In [8]:
df = pd.DataFrame({
    'A': pd.Series([1, 2, 3]),
    'B': pd.Series([4, 5, 6]),
    'C': pd.Series([7, 8, 9])
})
df

   A  B  C
0  1  4  7
1  2  5  8
2  3  6  9

### 3- From List of Dictionaries

In [11]:
data = [
    {'Name': 'Alice', 'Age': 25, 'City': 'New York'},
    {'Name': 'Bob', 'Age': 30, 'City': 'Paris'},
    {'Name': 'Charlie', 'Age': 35}  # Missing 'City'
]
df = pd.DataFrame(data)
# Missing values become NaN
df

      Name  Age      City
0    Alice   25  New York
1      Bob   30     Paris
2  Charlie   35       NaN

### 4 - From List of Lists

In [15]:
data = [
    ['Alice', 25, 'New York'],
    ['Bob', 30, 'Paris'],
    ['Charlie', 35, 'London']
]
df = pd.DataFrame(data, columns=['Name', 'Age', 'City' ])
df

      Name  Age      City
0    Alice   25  New York
1      Bob   30     Paris
2  Charlie   35    London

### 5- From NumPy Array

In [17]:
data = np.array([[1, 2, 3], [4, 5, 6], [7, 8, 9]])
df = pd.DataFrame(data, 
                  columns=['A', 'B', 'C'],
                  index=['row1', 'row2', 'row3'])
df

      A  B  C
row1  1  2  3
row2  4  5  6
row3  7  8  9

### 6 - From CSV File

In [ ]:
df = pd.read_csv('data.csv')